# Data Transformation: Pandas to SQL

In [1]:
# Import dependencies
import pandas as pd
from config import pgadmin_info
from sqlalchemy import create_engine
from sqlalchemy.dialects import postgresql

## Import data to Jupyter Notebook

In [2]:
# Read CSVs
xsustainibility_df = pd.read_csv("../resources/sustainability.csv")
xcountries_df = pd.read_csv("../resources/countries.csv")
xhappiness_df = pd.read_csv("../resources/happiness.csv")
xincome_pc_df = pd.read_csv("../resources/income_pc.csv", skiprows=4)
xppp_df = pd.read_csv("../resources/ppp.csv", skiprows=4)
xunemployment_df = pd.read_csv("../resources/unemployment.csv", skiprows=4)
xgdp_df = pd.read_csv("../resources/gdp.csv")

In [3]:
# Create regions table
regions_df = pd.DataFrame(xhappiness_df["Regional indicator"].copy())
regions_df = regions_df.reset_index()
regions_df = regions_df.groupby("Regional indicator", as_index=False).min()
regions_df = regions_df.rename(columns={'Regional indicator' : 'region_name',
                                            'index' : 'region_id',
                                            })
regions_df = regions_df[['region_id','region_name']].copy()
regions_df

   region_id                         region_name
0         18          Central and Eastern Europe
1         37  Commonwealth of Independent States
2         24                           East Asia
3         14         Latin America and Caribbean
4         13        Middle East and North Africa
5          7               North America and ANZ
6         65                          South Asia
7         30                      Southeast Asia
8         48                  Sub-Saharan Africa
9          0                      Western Europe

In [4]:
# Generate region IDs
rn_list = regions_df['region_name'].to_list()
regsid = []
for rn in rn_list:
    regid =[char for char in rn if char.isupper()]
    redstr = " "
    for i in range(len(regid)):
        redstr = redstr + f"{regid[i]}"
    regsid.append(redstr)
regions_df['region_id']=regsid
regions_df.iloc[7,0] = "SEA"
regions_df = pd.DataFrame(regions_df)
regions_df

  region_id                         region_name
0       CEE          Central and Eastern Europe
1       CIS  Commonwealth of Independent States
2        EA                           East Asia
3       LAC         Latin America and Caribbean
4      MENA        Middle East and North Africa
5     NAANZ               North America and ANZ
6        SA                          South Asia
7       SEA                      Southeast Asia
8       SSA                  Sub-Saharan Africa
9        WE                      Western Europe

In [5]:
# Generate countries table
countries_df = xcountries_df.rename(columns={'Country Code' : 'country_id',
                                            'Country' : 'country_name',
                                             'Population': 'population'
                                            })

countries_df.head()

     country_name country_id  population
0     Afghanistan        AFG    26023100
1   Åland Islands        ALA       28875
2         Albania        ALB     2893005
3         Algeria        DZA    39500000
4  American Samoa        ASM       55519

In [6]:
# Associate countries to respective region ID
df = xhappiness_df[['Country code', 'Regional indicator']]
df = df.rename(columns={'Country code' : 'country_id',
                        'Regional indicator': 'region_name'
                        })
rn_list = df['region_name'].to_list()
regsid = []
for rn in rn_list:
    regid =[char for char in rn if char.isupper()]
    redstr = " "
    for i in range(len(regid)):
        redstr = redstr + f"{regid[i]}"
    regsid.append(redstr)
df['region_id']=regsid
df = pd.DataFrame(df)
countries_df = countries_df.merge(df, how='inner')
countries_df = countries_df.drop(columns=['region_name'])
countries_df.to_csv('test.csv')
countries_df.head()

  country_name country_id  population region_id
0  Afghanistan        AFG    26023100        SA
1      Albania        ALB     2893005       CEE
2      Algeria        DZA    39500000      MENA
3    Argentina        ARG    43131966       LAC
4      Armenia        ARM     3006800       CIS

In [7]:
# Generate happiness table
happiness_df = xhappiness_df[['Country code', 'Ladder score', 'Social support', 'Explained by: Freedom to make life choices']]
happiness_df = happiness_df.rename(columns={'Country code' : 'country_id',
                                            'Ladder score' : 'happiness_index',
                                             'Social support': 'social_support',
                                             'Explained by: Freedom to make life choices':'freedom'
                                            })
happiness_df.head()

  country_id  happiness_index  social_support   freedom
0        FIN           7.8087        0.954330  0.662317
1        DNK           7.6456        0.955991  0.665040
2        CHE           7.5599        0.942847  0.628954
3        ISL           7.5045        0.974670  0.661981
4        NOR           7.4880        0.952487  0.670201

In [8]:
# Generate economy table
countrylist = xincome_pc_df['Country Code'].to_list()
incomelist = xincome_pc_df['2017'].to_list()
ppplist = xppp_df['2017'].to_list()
unemlist = xunemployment_df['2017'].to_list()
gdp_df = xgdp_df.loc[xgdp_df['Year'] == 2016]
gdp_df = gdp_df[['Country Code','Value']]
gdp_df = gdp_df.rename(columns={'Country Code': 'country_id', 'Value': 'gdp'})

economy_df = pd.DataFrame({'country_id':countrylist,'ppp': ppplist,
        'unemployment':unemlist, 'income_per_capita':incomelist})
economy_df = economy_df.merge(gdp_df, how='inner')
economy_df = economy_df[['country_id','gdp','ppp','unemployment','income_per_capita']]
economy_df.head()

  country_id           gdp        ppp  unemployment  income_per_capita
0        AFG  1.946902e+10  17.205558     11.180000         501.824389
1        AGO  9.533511e+10  92.951721      7.100000        2866.866692
2        ALB  1.186387e+10  42.255535     13.620000        3722.954182
3        AND  2.858518e+09        NaN           NaN                NaN
4        ARB  2.504703e+12        NaN     10.718497        5181.950189

In [9]:
# Generate sustainability table
sustainability_df = xsustainibility_df[['Country Code', 'People using  safely managed drinking water services  % of population 2017',
                                       'Access to electricity  % of population 2017', 'Renewable energy consumption  % of total final energy consumption 2015']]
sustainability_df = sustainability_df.rename(columns={'Country Code' : 'country_id',
                                                     sustainability_df.columns[1] : 'access_water',
                                                     sustainability_df.columns[2] : 'access_electricity',
                                                     sustainability_df.columns[3] : 'renewable_energy'})

sustainability_df.head()

  country_id  access_water  access_electricity  renewable_energy
0        AFG           NaN                97.7              18.4
1        ALB          70.0               100.0              38.6
2        DZA           NaN               100.0               0.1
3        ASM          12.6                 NaN               0.9
4        AND          90.6               100.0              19.7

In [10]:
# Generate health table
health_df = xhappiness_df[['Country code', 'Healthy life expectancy']]
health_df = health_df.rename(columns={'Country code' : 'country_id',
                                            'Healthy life expectancy' : 'healthy_life_exp',
                                            })
health_df.head()

  country_id  healthy_life_exp
0        FIN         71.900825
1        DNK         72.402504
2        CHE         74.102448
3        ISL         73.000000
4        NOR         73.200783

## Create connection to SQL

In [11]:
# Create engine
engine = create_engine(f'postgresql+psycopg2://postgres:{pgadmin_info}@localhost:5432/happiness-project')
connection = engine.connect()

In [12]:
# Check connection
engine.table_names()

['countries', 'regions', 'happiness', 'health', 'sustainability', 'economy']

## Load DataFrames into Database

In [13]:
# Load into Database
countries_df.to_sql(name='countries', con=engine, if_exists='append', index=False)
regions_df.to_sql(name='regions', con=engine, if_exists='append', index=False)
happiness_df.to_sql(name='happiness', con=engine, if_exists='append', index=False)
economy_df.to_sql(name='economy', con=engine, if_exists='append', index=False)
sustainability_df.to_sql(name='sustainability', con=engine, if_exists='append', index=False)
health_df.to_sql(name='health', con=engine, if_exists='append', index=False)

## Check if DataFrames were loaded

In [14]:
# Check countries
pd.read_sql_query('select * from countries', con=engine).head()

  country_id country_name  population region_id
0        AFG  Afghanistan  26023100.0        SA
1        ALB      Albania   2893005.0       CEE
2        DZA      Algeria  39500000.0      MENA
3        ARG    Argentina  43131966.0       LAC
4        ARM      Armenia   3006800.0       CIS

In [15]:
# Check regions
pd.read_sql_query('select * from regions', con=engine).head()

  region_id                         region_name
0       CEE          Central and Eastern Europe
1       CIS  Commonwealth of Independent States
2        EA                           East Asia
3       LAC         Latin America and Caribbean
4      MENA        Middle East and North Africa

In [16]:
# Check happiness
pd.read_sql_query('select * from happiness', con=engine).head()

  country_id  happiness_index  social_support   freedom
0        FIN           7.8087        0.954330  0.662317
1        DNK           7.6456        0.955991  0.665040
2        CHE           7.5599        0.942847  0.628954
3        ISL           7.5045        0.974670  0.661981
4        NOR           7.4880        0.952487  0.670201

In [17]:
# Check economy
pd.read_sql_query('select * from economy', con=engine).head()

  country_id           gdp        ppp  unemployment  income_per_capita
0        AFG  1.946902e+10  17.205558     11.180000         501.824389
1        AGO  9.533511e+10  92.951721      7.100000        2866.866692
2        ALB  1.186387e+10  42.255535     13.620000        3722.954182
3        AND  2.858518e+09        NaN           NaN                NaN
4        ARB  2.504703e+12        NaN     10.718497        5181.950189

In [18]:
# Check sustainability
pd.read_sql_query('select * from sustainability', con=engine).head()

  country_id  renewable_energy  access_electricity  access_water
0        AFG              18.4                97.7           NaN
1        ALB              38.6               100.0          70.0
2        DZA               0.1               100.0           NaN
3        ASM               0.9                 NaN          12.6
4        AND              19.7               100.0          90.6

In [19]:
# Check health
pd.read_sql_query('select * from health', con=engine).head()

  country_id  healthy_life_exp
0        FIN         71.900825
1        DNK         72.402504
2        CHE         74.102448
3        ISL         73.000000
4        NOR         73.200783